{"name":"scene-1","nodes":[{"type":"Sound","outs":[1],"src":"lift-ding.wav","id":0,"x":9,"y":50},{"type":"Dialog","outs":[2],"character":1,"text":"Command deck.","id":1,"x":232,"y":40,"options":[]},{"type":"Sound","outs":[3],"src":"door-open.wav","id":2,"x":456,"y":45},{"type":"Story","outs":[4],"text":"The doors open and you find yourself looking into a room of people looking back at you with both surprise and relief. The command deck seemed to be working on a skeleton crew while the ship was locked into orbit. ","id":3,"x":680,"y":45,"options":[]},{"type":"Dialog","outs":[5,6],"character":2,"text":"Glad to finally see you up and about Commander, and just in time too. ","id":4,"x":914,"y":43,"options":[{"text":"Just in time? ","active":true},{"text":"Not many people on deck, is everyone okay?","active":true}]},{"type":"Dialog","outs":[7],"character":2,"text":"Yes, I was just about to make a decision on how we should proceed in order to solve this orbit lock situation. I wanted to give a couple of days to see if the crew was going to come out of the worm coma before proceeding. For the most part the infected members seem to be waking up around the same time.","id":5,"x":1146,"y":27,"options":[]},{"type":"Dialog","outs":[7],"character":2,"text":"I have given them all time off while we waited to recooperate. I was just about to make a decision on how we should proceed in order to solve this orbit lock situation. I wanted to give a couple of days to see if the crew was going to come out of the worm coma before proceeding. For the most part the infected members seem to be waking up around the same time.","id":6,"x":1143,"y":269,"options":[]},{"type":"Dialog","outs":[8],"character":2,"text":"Join me in my quarters so we can discuss the plan of action","id":7,"x":1400,"y":37,"options":[]},{"type":"Story","outs":[9,10],"text":"The captain headed to the left into a room on the side of the command deck.","id":8,"x":1636,"y":34,"options":[{"text":"Follow the captain into his quarters","active":true},{"text":"Walk towards the main control center","active":true}]},{"type":"Jump","outs":[21],"src":"scene-1-captains-quarters.json","nodeId":0,"id":9,"x":1877,"y":340},{"type":"Story","outs":[11,9],"text":"You approach the center of the room. A large hologram map is projected showing the current solar system. It reads \"Ahëira J3\". You look around the room to see a very bored crew, some playing with their communication devices, some playing old school shoot em' up arcade games on their terminals.","id":10,"x":1877,"y":39,"options":[{"text":"Interact with map","active":true},{"text":"Head into captains quarters","active":true}]},{"type":"Story","outs":[14],"text":"The map suddenly comes to life and rotates to orient itself towards you. You gaze at it and see 4 planets, two of which are marked as habitable planets. An icon for the ship is orbiting around the second planet which is closer to the central star.","id":11,"x":2117,"y":23,"options":[]},{"type":"Dialog","outs":[15,16,17],"character":1,"text":"Hello commander, you've been absent for 3 days, 6 hours, and 9 minutes. The current status of the mission is \"on hold\" by order of the captain. We are currently in orbit around the second planet in this system. No danger has been detected however this ship is currently locked in orbit around the planet due to an unknown source emitting from the planet's surface.","id":14,"x":2355,"y":34,"options":[{"text":"Any signs of intelligent life on the planet?","active":true},{"text":"Has a distress signal been sent out?","active":true},{"text":"That is all","active":true}]},{"type":"Dialog","outs":[16,17],"character":1,"text":"After hours of scanning there seem to be no intelligent life on this planet.","id":15,"x":2615,"y":34,"options":[{"text":"Has a distress signal been sent out?","active":true},{"text":"That is all","active":true}]},{"type":"Dialog","outs":[15,17],"character":1,"text":"The distress signal has been sent out, but the same force that is holding us in orbit may be interfering with the data causing it to scramble. It may take weeks for the citadel to re-assemble it.","id":16,"x":2622,"y":354,"options":[{"text":"Any signs of intelligent life on the planet?","active":true},{"text":"That is all","active":true}]},{"type":"Story","outs":[9],"text":"The computer goes silent and the map reset to it's default position.","id":17,"x":2631,"y":669,"options":[{"text":"Head into captains quarters","active":true}]},{"type":"Story","outs":[27],"text":"This should now happen because it has returned to the other scene! :D","id":21,"x":2124,"y":335,"options":[]},{"type":"Jump","outs":[null],"src":"scene-1-planet.json","nodeId":0,"id":27,"x":2354,"y":488}]}